package com.example.demon.service;

public interface AdminService {

    // 관리자 페이지 - 사장님 가입정보 확인하기 //

    // 관리자 페이지 - 대기중인 사장님 회원가입 리스트 불러오기 //

    // 관리자 페이지 - 사장님 회원가입 승인 처리하기 //

    // 관리자 페이지 - 사장님 회원가입 반려 처리하기 //

    // 관리자 페이지 - 메인 화면 배너 추가하기 //

    // 관리자 페이지 - 메인 화면 배너 삭제하기 //

    // 관리자 페이지 - 메인 화면 배너 불러오기 //

    // 관리자 페이지 - 승인 대기중인 글램핑장 리스트 불러오기 //

    // 관리자 페이지 - 사장님 글램핑 등록 정보 불러오기 //

    // 관리자 페이지 - 글램핑 등록 승인 처리하기 //

    // 관리자 페이지 - 글램핑 등록 반려 처리하기 //

    // 관리자 페이지 - 회원탈퇴 대기 사장님 리스트 불러오기 //

    // 관리자 페이지 - 사장님 회원탈퇴 승인 처리하기 - 완료 //

}
